
  <details>
  <summary>terraform/backends - Terraform Plan Output (click to expand)</summary>
  
```
postgresql_role.mgmt: Refreshing state... [id=mgmt]
postgresql_database.mgmt: Refreshing state... [id=mgmt]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # postgresql_database.mgmt will be destroyed
  # (because postgresql_database.mgmt is not in configuration)
  - resource "postgresql_database" "mgmt" {
      - allow_connections = true -> null
      - connection_limit  = -1 -> null
      - encoding          = "UTF8" -> null
      - id                = "mgmt" -> null
      - is_template       = false -> null
      - lc_collate        = "en_US.UTF-8" -> null
      - lc_ctype          = "en_US.UTF-8" -> null
      - name              = "mgmt" -> null
      - owner             = "core" -> null
      - tablespace_name   = "pg_default" -> null
      - template          = "template0" -> null
    }

  # postgresql_database.mgmt_db will be created
  + resource "postgresql_database" "mgmt_db" {
      + allow_connections = true
      + connection_limit  = -1
      + encoding          = (known after apply)
      + id                = (known after apply)
      + is_template       = (known after apply)
      + lc_collate        = (known after apply)
      + lc_ctype          = (known after apply)
      + name              = "mgmt"
      + owner             = (known after apply)
      + tablespace_name   = (known after apply)
      + template          = (known after apply)
    }

  # postgresql_grant.mgmt_grant will be created
  + resource "postgresql_grant" "mgmt_grant" {
      + database          = "mgmt"
      + id                = (known after apply)
      + object_type       = "database"
      + privileges        = [
          + "USAGE",
        ]
      + role              = "mgmt"
      + with_grant_option = false
    }

  # postgresql_role.mgmt will be destroyed
  # (because postgresql_role.mgmt is not in configuration)
  - resource "postgresql_role" "mgmt" {
      - bypass_row_level_security           = false -> null
      - connection_limit                    = -1 -> null
      - create_database                     = false -> null
      - create_role                         = false -> null
      - encrypted_password                  = true -> null
      - id                                  = "mgmt" -> null
      - idle_in_transaction_session_timeout = 0 -> null
      - inherit                             = true -> null
      - login                               = true -> null
      - name                                = "mgmt" -> null
      - password                            = (sensitive value) -> null
      - replication                         = false -> null
      - roles                               = [] -> null
      - search_path                         = [] -> null
      - skip_drop_role                      = false -> null
      - skip_reassign_owned                 = false -> null
      - statement_timeout                   = 0 -> null
      - superuser                           = false -> null
      - valid_until                         = "infinity" -> null
        # (1 unchanged attribute hidden)
    }

  # postgresql_role.mgmt_role will be created
  + resource "postgresql_role" "mgmt_role" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = "mgmt"
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = false
      + skip_reassign_owned       = false
      + superuser                 = false
      + valid_until               = "infinity"
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
